Sync curriculum (2026-06-05 20:27)
